In [1]:
import pandas as pd
df = pd.read_csv('C:/Users/paula/csv_to_edit.csv')

In [2]:
display(df)

   Unnamed: 0 Visitor Arrivals\r20192021 Growth Rate(%)\r20192021
0        Jan.          2,689,33946,522 *                  -98.3 *
1        Feb.           2,604,3227,355 *                  -99.7 *
2        Mar.          2,760,13612,276 *                  -99.6 *
3        Apr.          2,926,68510,853 *                  -99.6 *
4         May          2,773,09110,035 *                  -99.6 *
5        Jun.           2,880,0419,251 *                  -99.7 *
6        Jul.          2,991,18951,055 *                  -98.3 *
7        Aug.          2,520,13425,916 *                  -99.0 *
8        Sep.          2,272,88317,720 *                  -99.2 *
9        Oct.         2,496,56822,100 **                 -99.1 **
10       Nov.         2,441,27420,700 **                 -99.2 **
11       Dec.                  2,526,387                      NaN

In [3]:
#Separating the yearly values into 2 different columns
df['column'] = df['Visitor Arrivals\r20192021'].astype(str)
df['Arrivals 2019'] = df['column'].str[0:9]
df['Arrivals 2021'] = df['column'].str[9:15]
df['Arrivals 2021']

0     46,522
1     7,355
2     12,276
3     10,853
4     10,035
5     9,251
6     51,055
7     25,916
8     17,720
9     22,100
10    20,700
11
Name: Arrivals 2021, dtype: object

In [4]:
#Creating a column for month dates
from datetime import datetime
date=['{0:02d}-01'.format(i) for i in range(1, 13)]
print(date)

['01-01', '02-01', '03-01', '04-01', '05-01', '06-01', '07-01', '08-01', '09-01', '10-01', '11-01', '12-01']

In [5]:
df['column1'] = df['Growth Rate(%)\r20192021'].astype(str)
df['Growth Rate'] =  df['column1'].str[0:5]
display(df['Growth Rate'])

0     -98.3
1     -99.7
2     -99.6
3     -99.6
4     -99.6
5     -99.7
6     -98.3
7     -99.0
8     -99.2
9     -99.1
10    -99.2
11      nan
Name: Growth Rate, dtype: object

In [6]:
df['date'] = pd.Series(date)
print (df['date'])

0     01-01
1     02-01
2     03-01
3     04-01
4     05-01
5     06-01
6     07-01
7     08-01
8     09-01
9     10-01
10    11-01
11    12-01
Name: date, dtype: object

In [7]:
result=pd.concat([df['date'], df['Arrivals 2019'],df['Arrivals 2021'],df['Growth Rate']], axis=1, join="inner")
display(result)

     date Arrivals 2019 Arrivals 2021 Growth Rate
0   01-01     2,689,339        46,522       -98.3
1   02-01     2,604,322        7,355        -99.7
2   03-01     2,760,136        12,276       -99.6
3   04-01     2,926,685        10,853       -99.6
4   05-01     2,773,091        10,035       -99.6
5   06-01     2,880,041        9,251        -99.7
6   07-01     2,991,189        51,055       -98.3
7   08-01     2,520,134        25,916       -99.0
8   09-01     2,272,883        17,720       -99.2
9   10-01     2,496,568        22,100       -99.1
10  11-01     2,441,274        20,700       -99.2
11  12-01     2,526,387                       nan

In [14]:
df_1=result['Arrivals 2019']
df_2=result['Arrivals 2021']
df_aa=df_1.append(df_2, ignore_index=True)
display(df_aa)

0     2,689,339
1     2,604,322
2     2,760,136
3     2,926,685
4     2,773,091
5     2,880,041
6     2,991,189
7     2,520,134
8     2,272,883
9     2,496,568
10    2,441,274
11    2,526,387
12       46,522
13       7,355
14       12,276
15       10,853
16       10,035
17       9,251
18       51,055
19       25,916
20       17,720
21       22,100
22       20,700
23
dtype: object

In [22]:
print(type(df_aa))

<class 'pandas.core.series.Series'>

In [24]:
value=df_aa.tolist()
print(value)

['2,689,339', '2,604,322', '2,760,136', '2,926,685', '2,773,091', '2,880,041', '2,991,189', '2,520,134', '2,272,883', '2,496,568', '2,441,274', '2,526,387', '46,522', '7,355 ', '12,276', '10,853', '10,035', '9,251 ', '51,055', '25,916', '17,720', '22,100', '20,700', '']

In [15]:
from datetime import datetime
date1=['{0:02d}-01'.format(i) for i in range(1, 13)]
date2=['{0:02d}-01'.format(i) for i in range(1, 13)]
date=(date1 + date2)
print(date)

['01-01', '02-01', '03-01', '04-01', '05-01', '06-01', '07-01', '08-01', '09-01', '10-01', '11-01', '12-01', '01-01', '02-01', '03-01', '04-01', '05-01', '06-01', '07-01', '08-01', '09-01', '10-01', '11-01', '12-01']

In [17]:
year2019=[2019]*12
year2021=[2021]*12
year=(year2019 + year2021)
print(year)

[2019, 2019, 2019, 2019, 2019, 2019, 2019, 2019, 2019, 2019, 2019, 2019, 2021, 2021, 2021, 2021, 2021, 2021, 2021, 2021, 2021, 2021, 2021, 2021]

In [25]:
import pandas as pd
dff=pd.DataFrame([year,value,date]).T
heads=['year','value','date']
dff.columns=heads
display(dff)

    year      value   date
0   2019  2,689,339  01-01
1   2019  2,604,322  02-01
2   2019  2,760,136  03-01
3   2019  2,926,685  04-01
4   2019  2,773,091  05-01
5   2019  2,880,041  06-01
6   2019  2,991,189  07-01
7   2019  2,520,134  08-01
8   2019  2,272,883  09-01
9   2019  2,496,568  10-01
10  2019  2,441,274  11-01
11  2019  2,526,387  12-01
12  2021     46,522  01-01
13  2021     7,355   02-01
14  2021     12,276  03-01
15  2021     10,853  04-01
16  2021     10,035  05-01
17  2021     9,251   06-01
18  2021     51,055  07-01
19  2021     25,916  08-01
20  2021     17,720  09-01
21  2021     22,100  10-01
22  2021     20,700  11-01
23  2021             12-01

In [46]:
result.to_csv('C:/Users/paula/japan_travel_2021.csv', encoding='utf-8')